# from math import factorial
# print(factorial(26))
# print(factorial(10))

# data=["ጿ","ኈ","ቼ","ዽ","ጿ","ኈ","ቼ","ዽ","ጿ","ኈ","ጿ","ኈ","ቼ","ዽ","ጿ","ኈ","ቼ","ዽ","ኈ","ጿ","ኈ","ቼ","ዽ","ጿ","ኈቼ","ዽ","ጿ","ኈ","ጿ","ኈ","ቼ","ዽ","ጿ","ኈቼ","ዽ","ጿ","ኈ","ጿ","ኈ","ቼ","ዽ","ጿ","ኈቼ","ዽ","ጿ","ኈጿ","ኈ","ቼ","ዽ","ጿ","ኈቼ","ዽ","ጿ","ኈ","ጿ","ኈ","ቼ","ዽ","ጿ","ኈቼ","ዽ","ጿ","ኈ","ጿ","ኈ","ቼ","ዽ","ጿ","ኈቼ","ዽ","ጿ","ኈ","ጿ","ኈ","ቼ","ዽ","ጿ","ኈቼ","ዽ","ጿ","ኈ","ጿ","ኈ","ቼ","ዽ","ጿ","ኈቼ","ዽ","ጿ","ኈጿ","ኈ","ቼ","ዽ","ጿ","ኈቼ","ዽ","ጿ","ኈ","ጿ","ኈ","ቼ","ዽ","ጿ","ኈቼ","ዽ","ጿ","ኈ","ጿ","ኈ","ቼ","ዽ","ጿ","ኈቼ","ዽ","ጿ","ኈ","ጿ","ኈ","ቼ","ዽ","ጿ","ኈቼ","ዽ","ጿ","ኈ","ጿ","ኈ","ቼ","ዽ","ጿ","ኈ","ቼ","ዽ","ጿ","ኈ"]
# for t in set(data):
#     print(t)

print(int("0000000000000392",16))
print(int("00000000000003ca",16))

